// classwork: გვაქვს კუბიკი, რომელზეც წერია click me
//როდესაც დავაჭერთ ეს კუბიკი რენდომულად გადაადგილდეს სხვაგან 


//ვქმით ცლადს,იმისთვის, რომ მივწვდეთ Html -ის ელემენტებს
const block = document.getElementById('block')

function Click(){
    let left = Math.random() * 500 // ვქმნით ცვლად რომელსაც ვანიჭებთ რენდომულ მნიშვნელოაბას
    let  top = Math.random() * 500 // ვქმნიტ ცვადს რომელსაც ვანიჭებთ რენდომ მნიშვნელობას
    let leftinteger = Math.floor(left) // ვქმნით ცვლადს, რომელსაც ვანიჭებს მთელი რიცხვის მნიშვნელობას პირველი ცვლადისას
    let topinteger = Math.floor(top) // ვქმნით ცვლადს, რომელსაც ვანიჭებთ მთელი რიცხვის მნიშვნელობას მეორე ცვლადისას 

    block.style.left = leftinteger + 'px' // მარვცნივ ვწევთ დივს რენდომ რიცხვ პიქსელით
    block.style.top = topinteger + 'px' // ზემოთ ვწევთ დივს რენდომ რიცხვ პიქსელით
}