//რა კოდიც დავწერეთ გაკვეთლზე ეგ დავწერთ და   კომენტარები მივუწეროთ

const stringFib = (array)=> {
    let final = '' // arrayში არსებული ითოეული ელემენტი ინახება 
    array.forEach((i) => {
        final += String(i) // final ცვლადს ვამატებთ თითოეულ ელემენტს სიიდან 
    })

    return final //ვაბრუნებთ ფინალურ ცვლადს 
}


const fibonacci = (n)=>{ // n -  რა რიცხვზე მოხდება გამოთვლა ( ანუ რამდენჯერ  დაემატოს ლისთს ახალი ელემენტი)
    let fib = [0,1] // ცვლადი , რომლის მნიშვნელობა არის სია დამ ასში ჩაყრილია 0 და 1 რიცხვები
    for(let i = 2 ; i < n + 1 ; i ++){ // i = 2 -ს იმიტომ რომ 2 ელემენტი უკვე არსებობს სიაში 
        fib.push(fib[i-1] + fib[i-2]) // პირველ ცდაზე - პირელ ინდექსზე მდგომ ელემენტს დაემატოს მენულე ინდექსზე დმგომი ელემენტი
    }
    return stringFib(fib) //გაამოვიძახეთ ზstringFib ფუნქცია და პარამეტრად გადავეცით სია fib(ამ ფნქციაში შექმნილი)
}

console.log(fibonacci(15))